nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/demo_apps/bubble_peripheral/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define GPIO_PUR_PU_2_MASK 0x04u /*!<@brief Pull Resistor Enable Bits Mask for item 2. */
#define GPIO_PUR_PU_3_MASK 0x08u /*!<@brief Pull Resistor Enable Bits Mask for item 3. */
#define PUR_PU_2_ENABLED 0x04u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_3_ENABLED 0x08u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC11 (number 37), U16[25]/TXD1
  @{ */
#define BOARD_TXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_TXD1_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_TXD1_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC12 (number 38), U16[26]/RXD1
  @{ */
#define BOARD_RXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_RXD1_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_RXD1_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOF2 (number 39), U14[4]/LP_SCL1
  @{ */
#define BOARD_LP_SCL1_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LP_SCL1_PIN 2U              /*!<@brief GPIOF pin index: 2 */
#define BOARD_LP_SCL1_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF3 (number 40), J1[12]/U14[6]/LP_SDA1
  @{ */
#define BOARD_LP_SDA1_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LP_SDA1_PIN 3U              /*!<@brief GPIOF pin index: 3 */
#define BOARD_LP_SDA1_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF6 (number 58), J2[2]/D5/USER_LED1
  @{ */
#define BOARD_LED_RED_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_RED_PIN 6U              /*!<@brief GPIOF pin index: 6 */
#define BOARD_LED_RED_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define GPIO_PUR_PU_2_MASK 0x04u /*!<@brief Pull Resistor Enable Bits Mask for item 2. */
#define GPIO_PUR_PU_3_MASK 0x08u /*!<@brief Pull Resistor Enable Bits Mask for item 3. */
#define PUR_PU_2_ENABLED 0x04u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_3_ENABLED 0x08u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */

/*! @name GPIOF2 (number 39), U14[4]/LP_SCL1
  @{ */
#define ACCEL_INITPINS_LP_SCL1_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define ACCEL_INITPINS_LP_SCL1_PIN 2U              /*!<@brief GPIOF pin index: 2 */
#define ACCEL_INITPINS_LP_SCL1_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name GPIOF3 (number 40), J1[12]/U14[6]/LP_SDA1
  @{ */
#define ACCEL_INITPINS_LP_SDA1_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define ACCEL_INITPINS_LP_SDA1_PIN 3U              /*!<@brief GPIOF pin index: 3 */
#define ACCEL_INITPINS_LP_SDA1_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Accel_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
